src/cf/InformationRegisters/ПрочитанныеДанныеСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДанныеСообщенийОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбъектаВИсточнике</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СодержимоеЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПространствоИменURI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальноеИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ПрочитанныеДанныеСообщенийОбмена/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаписьДанных

// Конструктор новой записи регистра
// 
// Возвращаемое значение:
//  Структура - Содержит:
// * ПолученныйОбъект           - Строка - идентификатор полученного объекта.
// * УзелПланаОбмена            - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для которого
//                                                                               поступило сообщение.
// * ОбъектФормата              - Строка - имя объекта в пространстве имен.
// * ДатаОбъектаВИсточнике      - Дата - дата объекта согласно бизнес-логики. Например для документов как правило это
//                                       дата документа. Для справочников как правило не заполнена. Учитывается при
//                                       определении порядка обработки объектов.
// * Приоритет                  - Число - значение упорядочивания, которое используется при определении порядка
//                                        обработки объектов.
// * СодержимоеЗаписи           - Строка - текст XML, который содержит данные объекта в формате Enterprise Data
// * ПространствоИменURI        - Строка - пространство имен формата обмена.
// * ДатаДобавления             - Дата - дата и время добавления записи в регистр.
// * КлючОбрабатывающегоЗадания - Строка - уникальный идентификатор обрабатывающего задания.
//
Функция НовыйДанныеЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("ПолученныйОбъект",                    "");
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                     Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектФормата",                       "");
	
	ДанныеЗаписиРегистра.Вставить("ДатаОбъектаВИсточнике",               Дата(1, 1, 1));
	ДанныеЗаписиРегистра.Вставить("Приоритет",                           0);
	ДанныеЗаписиРегистра.Вставить("СодержимоеЗаписи",                    "");
	ДанныеЗаписиРегистра.Вставить("ПространствоИменURI ",                "");
	
	ДанныеЗаписиРегистра.Вставить("ДатаДобавления",                      Дата(1, 1, 1));
	ДанныеЗаписиРегистра.Вставить("КлючОбрабатывающегоЗадания",          "");
	
	Возврат ДанныеЗаписиРегистра;
	
КонецФункции

// Конструктор изменяемой записи регистра. Используется в том случае, если требуется изменить уже существующую запись регистра.
// При изменении записи будут изменены только те данные записи, которые в переданной структуре не будут иметь значение Неопределено.
// 
// Возвращаемое значение:
//  Структура - Содержит:
// * ПолученныйОбъект           - Строка - идентификатор полученного объекта.
// * УзелПланаОбмена            - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для которого
//                                                                               поступило сообщение.
// * ОбъектФормата              - Строка - имя объекта в пространстве имен.
// * ДатаОбъектаВИсточнике      - Неопределено - дата объекта согласно бизнес-логики. Например для документов как
//                                       правило это дата документа. Для справочников как правило не заполнена.
//                                       Учитывается при определении порядка обработки объектов.
// * Приоритет                  - Неопределено - значение упорядочивания, которое используется при определении порядка
//                                               обработки объектов.
// * СодержимоеЗаписи           - Неопределено - текст XML, который содержит данные объекта в формате Enterprise Data
// * ПространствоИменURI        - Неопределено - пространство имен формата обмена.
// * ДатаДобавления             - Неопределено - дата и время добавления записи в регистр.
// * КлючОбрабатывающегоЗадания - Неопределено - уникальный идентификатор обрабатывающего задания.
//
Функция НовыйДанныеИзмененияЗаписиРегистра() Экспорт
	
	ДанныеЗаписиРегистра = Новый Структура;
	
	ДанныеЗаписиРегистра.Вставить("ПолученныйОбъект",                    "");
	ДанныеЗаписиРегистра.Вставить("УзелПланаОбмена",                     Неопределено);
	ДанныеЗаписиРегистра.Вставить("ОбъектФормата ",                      "");
	
	ДанныеЗаписиРегистра.Вставить("ДатаОбъектаВИсточнике",               Неопределено);
	ДанныеЗаписиРегистра.Вставить("Приоритет",                           Неопределено);
	ДанныеЗаписиРегистра.Вставить("СодержимоеЗаписи",                    Неопределено);
	ДанныеЗаписиРегистра.Вставить("ПространствоИменURI ",                Неопределено);
	
	ДанныеЗаписиРегистра.Вставить("ДатаДобавления ",                     Неопределено);
	ДанныеЗаписиРегистра.Вставить("КлючОбрабатывающегоЗадания",          Неопределено);
	
	Возврат ДанныеЗаписиРегистра
	
КонецФункции

// Выполняет запись в регистр
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//
Процедура ЗаписатьДанные(ДанныеЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеЗаписи);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеЗаписиРегистра
//  ПроверитьДатуДобавления - Булево - признак необходимости проверки, что удаляемая запись имеет ту же дату добавления
//                                     что и текущая дата.
//
Процедура УдалитьЗаписьРегистра(ДанныеЗаписи, ПроверитьДатуДобавления = Ложь) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	Если ПроверитьДатуДобавления Тогда
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 1 Тогда
			
			Если НаборЗаписей[0].ДатаДобавления <> ДанныеЗаписи.ДатаДобавления Тогда
				Возврат;
			Иначе
				НаборЗаписей.Очистить();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Блокирует запись регистра для дальнейшего изменения.
// 
// Параметры:
//  ПолученныйОбъект - Строка - идентификатор полученного объекта.
//  УзелПланаОбмена  - ПланОбменаСсылкаИмяПланаОбмена- узел плана обмена, для которого поступило сообщение.
//  ОбъектФормата    - Строка - имя объекта в пространстве имен.
//
Процедура ЗаблокироватьЗаписьРегистра(ПолученныйОбъект, УзелПланаОбмена, ОбъектФормата) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрочитанныеДанныеСообщенийОбмена");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ПолученныйОбъект", ПолученныйОбъект);
	ЭлементБлокировки.УстановитьЗначение("УзелПланаОбмена",  УзелПланаОбмена);
	ЭлементБлокировки.УстановитьЗначение("ОбъектФормата",    ОбъектФормата);
	
	// @skip-warning - транзакция открывается в вызывающих процедурах
	Блокировка.Заблокировать(); 
	
КонецПроцедуры

// Изменяет существующую запись регистра. Будут изменены только те данные, которые в структуре ДанныеЗаписи не равны Неопределено. 
// 
// Параметры:
//  ДанныеЗаписи - см. НовыйДанныеИзмененияЗаписиРегистра
// 
Процедура ИзменитьЗаписьРегистра(ДанныеЗаписи) Экспорт
	
	ДанныеРегистра = НаборИЗаписьРегистра(ДанныеЗаписи);
	
	Для Каждого КлючИЗначение Из ДанныеЗаписи Цикл
		
		Если КлючИЗначение.Значение <> Неопределено Тогда
			
			ДанныеРегистра.ЗаписьНабора[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеРегистра.НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ЧтениеПакетаОбмена

// Метод используется для переноса данных из сообщения обмена (xml-файл) в информационную базу.
// Данные из сообщения обмена переносятся по объектам в регистр "ПрочитанныеДанныеСообщенийОбмена".
//
// Параметры:
//  КомпонентыОбмена  см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Процедура СообщениеОбменаВРегистрИБ(КомпонентыОбмена) Экспорт
	
	Пока КомпонентыОбмена.ФайлОбмена.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		
		РезультатЧтения = РезультатЧтенияЭлементаПакетаСообщенияОбмена(КомпонентыОбмена, КомпонентыОбмена.ФайлОбмена, "");
		
		Если Не РезультатЧтения.Успешно Тогда
			
			КомпонентыОбмена.ЧтениеЭлементаПутемКопированияФрагментаПотока = Истина;
			
			// @skip-check query-in-loop - Порционная обработка данных
			УдалитьДанныеПоКлючуОбрабатывающегоЗадания(КомпонентыОбмена.КлючОбрабатывающегоЗадания);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если КомпонентыОбмена.ЧтениеЭлементаПутемКопированияФрагментаПотока Тогда
		
		УдалитьДанныеПоКлючуОбрабатывающегоЗадания(КомпонентыОбмена.КлючОбрабатывающегоЗадания);
		
		КомпонентыОбмена.ФайлОбмена.Закрыть();
		
		ОбменДаннымиXDTOСервер.ОткрытьФайлЗагрузки(КомпонентыОбмена, КомпонентыОбмена.ИмяФайлаСообщенияОбмена, Истина);
		
		Если КомпонентыОбмена.ФлагОшибки Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Пока КомпонентыОбмена.ФайлОбмена.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
			
			РезультатКопирования = РезультатКопированияФрагментаПотока(КомпонентыОбмена.ФайлОбмена);
		
			РезультатЧтенияЭлементаПакетаСообщенияОбмена(КомпонентыОбмена, ПотокЧтенияФрагмента(РезультатКопирования.ТекстФрагмента), РезультатКопирования.ТекстФрагмента);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыборкаИзРегистра

// Конструктор параметров выборки данных из запроса для последующей обработки
// 
// Возвращаемое значение:
//  Структура - содержит:
// * КоличествоВПорции - Число - количество объектов в порции
// * КлючОбрабатывающегоЗадания - Строка - уникальный идентификатор обрабатывающего задания
// * УзелПланаОбмена - Неопределено, ПланОбменаСсылкаИмяПланаОбмена - план обмена, для которого будут получаться данные.
// * ОчищатьПодлежащиеУдалению - Булево - признак того, что требуется удалить лишние записи из регистра перед получением
//                                        данных.
//                                        
Функция НовыйПараметрыВыборкиДанных() Экспорт
	
	ПараметрыВыборки = Новый Структура;
	
	ПараметрыВыборки.Вставить("КоличествоВПорции",                   100);
	ПараметрыВыборки.Вставить("УзелПланаОбмена",                     Неопределено);
	ПараметрыВыборки.Вставить("КлючОбрабатывающегоЗадания",          "");
	ПараметрыВыборки.Вставить("ОчищатьПодлежащиеУдалению",           Истина);
	
	Возврат ПараметрыВыборки;
	
КонецФункции

// Получает порцию данных регистра для обработки.
// 
// Параметры:
//  ПараметрыОбработки - см. НовыйПараметрыВыборкиДанных
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Содержит:
// * ПолученныйОбъект                - Строка - идентификатор полученного объекта.
// * УзелПланаОбмена                 - ПланОбменаСсылкаИмяПланаОбмена, Неопределено - узел плана обмена, для которого
//                                                                                    поступило сообщение.
// * СодержимоеЗаписи                - Строка - текст XML, который содержит данные объекта в формате Enterprise Data
// * ПространствоИменURI             - Строка - пространство имен формата обмена.
// * ОбъектФормата                   - Строка - имя объекта в пространстве имен.
// * ДатаОбрабатываемойВерсии        - Дата   - дата и время добавления записи в РС "Прочитанные данные сообщений обмена".
// * ПравилоКонвертации              - Строка - заполнено, если полученный объект уже обрабатывался ранее.
// * ПричинаДобавления               - ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - Неопределено, в
//     случае если объект еще не обрабатывался.
// * ДанныеСконвертированногоОбъекта - ХранилищеЗначения - данные уже ранее сконвертированного объекта в формате JSON,
//                                                         может быть неопределено.
//
Функция ВыбранныеДанныеДляОбработки(ПараметрыОбработки, КомпонентыОбмена) Экспорт
	
	ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();
	
	Если ПараметрыОбработки.ОчищатьПодлежащиеУдалению Тогда
		РегистрыСведений.ОбъектыКЗагрузке.ОчиститьЗаписиПодлежащиеУдалениюПередПередачейНаКонвертацию(ПараметрыОбработки);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ВложенныйЗапрос.ПолученныйОбъект           КАК ПолученныйОбъект,
	|	ВложенныйЗапрос.Приоритет                  КАК Приоритет,
	|	ВложенныйЗапрос.ДатаОбъектаВИсточнике      КАК ДатаОбъектаВИсточнике,
	|	ВложенныйЗапрос.УзелПланаОбмена            КАК УзелПланаОбмена,
	|	ВложенныйЗапрос.ДатаДобавления             КАК ДатаДобавления,
	|	ВложенныйЗапрос.ДатаОбрабатываемойВерсии   КАК ДатаОбрабатываемойВерсии,
	|	ВложенныйЗапрос.ПространствоИменURI        КАК ПространствоИменURI,
	|	ВложенныйЗапрос.ОбъектФормата              КАК ОбъектФормата,
	|	ВложенныйЗапрос.ПричинаДобавления          КАК ПричинаДобавления,
	|	ВложенныйЗапрос.ПравилоКонвертации         КАК ПравилоКонвертации
	|ПОМЕСТИТЬ ДанныеДляОбработки
	|ИЗ 
	|(ВЫБРАТЬ
	|	ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект                                                    КАК ПолученныйОбъект,
	|	ПрочитанныеДанныеСообщенийОбмена.Приоритет                                                           КАК Приоритет,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаОбъектаВИсточнике                                               КАК ДатаОбъектаВИсточнике,
	|	ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена                                                     КАК УзелПланаОбмена,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления                                                      КАК ДатаДобавления,
	|	ЕстьNULL(ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии, ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления) КАК ДатаОбрабатываемойВерсии,
	|	ПрочитанныеДанныеСообщенийОбмена.ПространствоИменURI                                                 КАК ПространствоИменURI,
	|	ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата                                                       КАК ОбъектФормата,
	|	НЕОПРЕДЕЛЕНО                                                                                         КАК ПричинаДобавления,
	|	""""                                                                                                 КАК ПравилоКонвертации
	|ИЗ
	|	РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|		И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена   = ОбъектыКЗагрузке.УзелПланаОбмена
	|		И ОбъектыКЗагрузке.ПричинаДобавления <> ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта)
	|ГДЕ
	|	ПрочитанныеДанныеСообщенийОбмена.Приоритет > -2
	|	И &ТекстУсловияПрочитанныеДанные
	|	И ОбъектыКЗагрузке.ПолученныйОбъект ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект               КАК ПолученныйОбъект,
	|	-1                                                              КАК Приоритет,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаОбъектаВИсточнике          КАК ДатаОбъектаВИсточнике,
	|	ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена                КАК УзелПланаОбмена,
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления                 КАК ДатаДобавления,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии                       КАК ДатаОбрабатываемойВерсии,
	|	ПрочитанныеДанныеСообщенийОбмена.ПространствоИменURI            КАК ПространствоИменURI,
	|	ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата                  КАК ОбъектФормата,
	|	ОбъектыКЗагрузке.ПричинаДобавления                              КАК ПричинаДобавления,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                             КАК ПравилоКонвертации
	|ИЗ
	|	РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект = ОбъектыКЗагрузке.ПолученныйОбъект
	|			И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ГотовоКЗагрузке)
	|			И &ТекстУсловияОбъектыКЗагрузке
	|ГДЕ
	|	ПрочитанныеДанныеСообщенийОбмена.Приоритет > -2) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО 
	|	ВложенныйЗапрос.Приоритет,
	|	ВложенныйЗапрос.ДатаОбъектаВИсточнике
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляОбработки.ПолученныйОбъект                                      КАК ПолученныйОбъект,
	|	ДанныеДляОбработки.Приоритет                                             КАК Приоритет,
	|	ДанныеДляОбработки.УзелПланаОбмена                                       КАК УзелПланаОбмена,
	|	ДанныеДляОбработки.ДатаДобавления                                        КАК ДатаДобавления,
	|	ДанныеДляОбработки.ДатаОбрабатываемойВерсии                              КАК ДатаОбрабатываемойВерсии,
	|	ДанныеДляОбработки.ПространствоИменURI                                   КАК ПространствоИменURI,
	|	ДанныеДляОбработки.ОбъектФормата                                         КАК ОбъектФормата,
	|	ДанныеДляОбработки.ПричинаДобавления                                     КАК ПричинаДобавления,
	|	ДанныеДляОбработки.ПравилоКонвертации                                    КАК ПравилоКонвертации,
	|	ПрочитанныеДанныеСообщенийОбмена.СодержимоеЗаписи                        КАК СодержимоеЗаписи
	|ИЗ
	|	ДанныеДляОбработки КАК ДанныеДляОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ДанныеДляОбработки.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|		И ДанныеДляОбработки.УзелПланаОбмена   = ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена
	|";
	
	Если ПараметрыОбработки.КоличествоВПорции <> 100 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 100", "Первые" + " " + Строка(ПараметрыОбработки.КоличествоВПорции));
		
	КонецЕсли;
	
	ТекстУсловияПрочитанныеДанные = "";
	ТекстУсловияОбъектыКЗагрузке  = "";
	
	Если ЗначениеЗаполнено(ПараметрыОбработки.УзелПланаОбмена) Тогда
		
		ТекстУсловияПрочитанныеДанные = ТекстУсловияПрочитанныеДанные + Символы.ПС + "И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = &УзелПланаОбмена";
		Запрос.УстановитьПараметр("УзелПланаОбмена", ПараметрыОбработки.УзелПланаОбмена);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбработки.КлючОбрабатывающегоЗадания) Тогда
		
		ТекстУсловияПрочитанныеДанные = ТекстУсловияПрочитанныеДанные + Символы.ПС + "И ПрочитанныеДанныеСообщенийОбмена.КлючОбрабатывающегоЗадания = &КлючОбрабатывающегоЗадания";
		Запрос.УстановитьПараметр("КлючОбрабатывающегоЗадания", ПараметрыОбработки.КлючОбрабатывающегоЗадания);
		
		ТекстУсловияОбъектыКЗагрузке = ТекстУсловияОбъектыКЗагрузке + Символы.ПС + "И ОбъектыКЗагрузке.КлючОбрабатывающегоЗадания = &КлючОбрабатывающегоЗадания"
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстУсловияПрочитанныеДанные", ТекстУсловияПрочитанныеДанные);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстУсловияОбъектыКЗагрузке",  ТекстУсловияОбъектыКЗагрузке);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.ПричинаДобавления) Тогда
					Продолжить;
				КонецЕсли;
				
				РегистрыСведений.ОбъектыБлокирующиеЗагрузку.УдалитьЗаписиРегистраПоПолученномуОбъекту(Выборка.ПолученныйОбъект, Выборка.УзелПланаОбмена, Выборка.ОбъектФормата);
				
			КонецЦикла;
			
			Выборка.Сбросить();
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЕсли;
	
	ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
			ВремяНачала, "ВыборкаДанныхРегистраПрочитанныеДанныеДляКонвертации", "", КомпонентыОбмена, 
			ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека());
			
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеПакетОбмена

Процедура ПрочитатьДанныеОбъектаXDTO(Результат, ОбъектXDTO, ЧтениеXML, ТипОбъектаXDTO, ПутьКДата)
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	СвойстваОбъектаXDTO = ОбъектXDTO.Свойства();
	
	Если ТипОбъектаXDTO.Имя = "УдалениеОбъекта" Тогда
		
		СвойствоСсылкаНаОбъект = СвойстваОбъектаXDTO.Получить("СсылкаНаОбъект");
		
		Если СвойствоСсылкаНаОбъект <> Неопределено Тогда
			
			ОбъектXDTOУдаление = ОбъектXDTO.ПолучитьXDTO("СсылкаНаОбъект").ПолучитьXDTO("СсылкаНаОбъект"); 
			
			Для Каждого СвойствоXDTO Из ОбъектXDTOУдаление.Свойства() Цикл
				
				СсылкаУдаляемого = ОбъектXDTOУдаление.Получить(СвойствоXDTO.Имя);
				Если СсылкаУдаляемого <> Неопределено Тогда
					
					Результат.ПолученныйОбъект = СсылкаУдаляемого;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		ИмяКлассаКлючевыеСвойства = ОбменДаннымиXDTOСервер.КлассКлючевыеСвойстваФормата();
		ИмяКлассаСсылка           = ОбменДаннымиXDTOСервер.КлассСсылкаФормата();
		
		ЕстьКлючевыеСвойства = СвойстваОбъектаXDTO.Получить(ИмяКлассаКлючевыеСвойства) <> Неопределено;
		
		Если ЕстьКлючевыеСвойства Тогда
			
			СвойствоКлючевыеСвойства = ОбъектXDTO.ПолучитьXDTO(ИмяКлассаКлючевыеСвойства);
			
			Если СвойствоКлючевыеСвойства <> Неопределено Тогда 
				
				КлючевыеСвойства = ОбъектXDTO.ПолучитьXDTO(ИмяКлассаКлючевыеСвойства);
				
				СвойствоСсылка = КлючевыеСвойства.Свойства().Получить(ИмяКлассаСсылка);
				
				Если СвойствоСсылка <> Неопределено Тогда
					
					Результат.ПолученныйОбъект = КлючевыеСвойства.Ссылка;
					
				КонецЕсли;
				
				Если Не ПустаяСтрока(ПутьКДата) Тогда
					
					ЧастиПутьКДата = СтрРазделить(ПутьКДата, ".");
					
					Если ЧастиПутьКДата.Количество() <> 2 Тогда
						Возврат;
					КонецЕсли;
					
					Если ЧастиПутьКДата[0] = ИмяКлассаКлючевыеСвойства Тогда
						
						СвойствоДатаДокумента = КлючевыеСвойства.Свойства().Получить(ЧастиПутьКДата[1]);
						
						Если СвойствоДатаДокумента <> Неопределено Тогда
							
							Результат.Дата = КлючевыеСвойства[ЧастиПутьКДата[1]];
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ПостфиксСвойстваОтбор     = ОбменДаннымиXDTOСервер.ПостфиксСвойстваОтбор();
			ДлинаПостфикса            = СтрДлина(ПостфиксСвойстваОтбор);
			ДанныеДляФормированияХэша = Новый Соответствие;
			
			Для Каждого СвойствоОбъекта Из СвойстваОбъектаXDTO Цикл
				
				Если Прав(СвойствоОбъекта.Имя, ДлинаПостфикса) = ПостфиксСвойстваОтбор Тогда
					
					ЗначениеСвойства = ОбъектXDTO.Получить(СвойствоОбъекта.Имя);
					Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
						
						Если ЗначениеСвойства.Свойства().Получить(ИмяКлассаСсылка) <> Неопределено Тогда
							
							ДанныеДляФормированияХэша.Вставить(СвойствоОбъекта.Имя, ЗначениеСвойства.Ссылка);
							
						КонецЕсли;
						
					Иначе
						
						ДанныеДляФормированияХэша.Вставить(СвойствоОбъекта.Имя, Строка(ЗначениеСвойства))
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Результат.ПолученныйОбъект = ХэшДанных(ДанныеДляФормированияХэша);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОтразитьОшибкуПриРазбореЭлементаПакетаОбмена(Результат, ТекстОшибки, ТекстФрагмента = "")
	
	Результат.СодержимоеЗаписи = ТекстФрагмента;
	
	Результат.ОшибкаКонвертации      = Истина;
	Результат.ПолученныйОбъект       = ХэшXMLСообщенияОбмена(Результат.СодержимоеЗаписи);
	Результат.Статус                 = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации;
	Результат.КраткоеПредставление   = ТекстОшибки;
	Результат.ПолноеПредставление    = Результат.КраткоеПредставление;
	Результат.Приоритет              = - 2;
	
КонецПроцедуры 

Функция ТекстXMLИзОбъектаXDTO(ОбъектXDTO)
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция ХэшXMLСообщенияОбмена(ДанныеXML)
	
	Данные = Новый Соответствие;
	Данные.Вставить("ДанныеXML",      ДанныеXML);
	
	Возврат ХэшДанных(Данные);
	
КонецФункции

Функция ХэшДанных(Данные)
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХешированиеДанных.Добавить(ЗначениеВСтрокуВнутр(Данные));
	
	Возврат Строка(ХешированиеДанных.ХешСумма);
	
КонецФункции

Процедура СкопироватьУзелXMLИзПотокаВПоток(ЧтениеXML, ЗаписьXML, Поток)
	
		ЗаписьXML.ЗаписатьНачалоЭлемента(ЧтениеXML.Имя);
		Для Сч = 0 По ЧтениеXML.КоличествоАтрибутов() - 1 Цикл
			ИмяАтрибута = ЧтениеXML.ИмяАтрибута(Сч);
			ЗначениеАтрибута = ЧтениеXML.ЗначениеАтрибута(Сч);
			ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута, ЗначениеАтрибута);
		КонецЦикла;
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				СкопироватьУзелXMLИзПотокаВПоток(ЧтениеXML, ЗаписьXML, Поток);
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				ЗаписьXML.ЗаписатьТекст(ЧтениеXML.Значение);
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				ЗаписьXML.ЗаписатьКонецЭлемента();
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
	
КонецПроцедуры

Функция ПланОбменаЭтотУзелУниверсальныйФормат()
	
	УзелПланаОбмена = Неопределено;
	
	ИмяПланаОбмена = "";
	
	Для Каждого ТипПараметраКоманды Из Метаданные.ОбщиеКоманды.Синхронизировать.ТипПараметраКоманды.Типы() Цикл
		
		МетаданныеПланаОбмена = Метаданные.НайтиПоТипу(ТипПараметраКоманды);
		
		Если МетаданныеПланаОбмена.Реквизиты.Найти("ВерсияФорматаОбмена") <> Неопределено Тогда
			
			ИмяПланаОбмена = МетаданныеПланаОбмена.Имя; 
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		Возврат УзелПланаОбмена;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбновлениеИнформационнойБазы.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ОбновлениеИнформационнойБазы КАК ОбновлениеИнформационнойБазы
	|ГДЕ
	|	ОбновлениеИнформационнойБазы.ЭтотУзел";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбновлениеИнформационнойБазы", ИмяПланаОбмена);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат УзелПланаОбмена;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		УзелПланаОбмена = Выборка.Ссылка;
	
	КонецЦикла;
	
	Возврат УзелПланаОбмена;
	
КонецФункции

Функция ПотокЧтенияФрагмента(Знач Фрагмент)
	
	ЧтениеФрагмента = Новый ЧтениеXML();
	ЧтениеФрагмента.УстановитьСтроку(Фрагмент);
	ЧтениеФрагмента.ПерейтиКСодержимому();
	
	Возврат ЧтениеФрагмента;
	
КонецФункции

Функция РезультатРазбораЭлементаПриЧтенииПакетаОбмена(КомпонентыОбмена, ПотокЧтения, ТекстФрагмента)
	
	РезультатРазбора = Новый Структура;
	РезультатРазбора.Вставить("ДанныеЗаписи",    Неопределено);
	РезультатРазбора.Вставить("СтатусОбработки", Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ПустаяСсылка());
	
	ДанныеОшибки = Новый Структура;
	ДанныеОшибки.Вставить("ПолноеПредставление",  "");
	ДанныеОшибки.Вставить("КраткоеПредставление", "");
	
	РезультатРазбора.Вставить("ДанныеОшибки", ДанныеОшибки);
	
	РезультатРазбора.ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
	
	РезультатРазбора.ДанныеЗаписи.УзелПланаОбмена                     = УзелПланаОбменаСообщения(КомпонентыОбмена);
	РезультатОбработкиЭлемента                                        = XMLОбъектаИзФайлаСообщенияЧерезФабрикуXDTO(КомпонентыОбмена, ПотокЧтения, ТекстФрагмента);
	
	РезультатРазбора.СтатусОбработки                   = РезультатОбработкиЭлемента.Статус;
	РезультатРазбора.ДанныеОшибки.ПолноеПредставление  = РезультатОбработкиЭлемента.ПолноеПредставление;
	РезультатРазбора.ДанныеОшибки.КраткоеПредставление = РезультатОбработкиЭлемента.КраткоеПредставление;
	
	Если РезультатОбработкиЭлемента.Статус = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации
		И Не КомпонентыОбмена.ЧтениеЭлементаПутемКопированияФрагментаПотока Тогда 
		
		Возврат  РезультатРазбора;
		
	КонецЕсли;
	РезультатРазбора.ДанныеЗаписи.СодержимоеЗаписи                    = РезультатОбработкиЭлемента.СодержимоеЗаписи;
	РезультатРазбора.ДанныеЗаписи.Приоритет                           = РезультатОбработкиЭлемента.Приоритет;
	РезультатРазбора.ДанныеЗаписи.ПространствоИменURI                 = РезультатОбработкиЭлемента.ПространствоИменURI;
	РезультатРазбора.ДанныеЗаписи.ОбъектФормата                       = РезультатОбработкиЭлемента.ОбъектФормата;
	РезультатРазбора.ДанныеЗаписи.ДатаОбъектаВИсточнике               = РезультатОбработкиЭлемента.Дата;
	РезультатРазбора.ДанныеЗаписи.ПолученныйОбъект                    = РезультатОбработкиЭлемента.ПолученныйОбъект;
	РезультатРазбора.ДанныеЗаписи.КлючОбрабатывающегоЗадания          = КомпонентыОбмена.КлючОбрабатывающегоЗадания;
	РезультатРазбора.ДанныеЗаписи.ДатаДобавления                      = ТекущаяДатаСеанса();

	Возврат РезультатРазбора;
	
КонецФункции

Функция XMLОбъектаИзФайлаСообщенияЧерезФабрикуXDTO(КомпонентыОбмена, ПотокЧтения, ТекстФрагмента)
	
	ЧтениеXML  = КомпонентыОбмена.ФайлОбмена;
	ОбъектXDTO = Неопределено;
	
	Результат = Новый Структура;
	Результат.Вставить("ОшибкаКонвертации",          Ложь);
	Результат.Вставить("СодержимоеЗаписи",           "");
	Результат.Вставить("ПолноеПредставление",        "");
	Результат.Вставить("КраткоеПредставление",       "");
	Результат.Вставить("ПространствоИменURI",        "");
	Результат.Вставить("ОбъектФормата",              "");
	Результат.Вставить("ПолученныйОбъект",           "");
	Результат.Вставить("Приоритет",                 - 1); 
	Результат.Вставить("Дата",                      Дата(1, 1, 1));
	Результат.Вставить("Статус",                    Неопределено);
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПотокЧтения.КонтекстПространствИмен.ПространствоИменПоУмолчанию, ПотокЧтения.ЛокальноеИмя);
	
	Если ТипОбъектаXDTO = Неопределено Тогда
		
		ОтразитьОшибкуПриРазбореЭлементаПакетаОбмена(Результат, НСтр("ru = 'Не удалось получить тип объекта по пространству имен'"), ТекстФрагмента);
		
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.ПространствоИменURI  = ТипОбъектаXDTO.URIПространстваИмен;
	Результат.ОбъектФормата        = ТипОбъектаXDTO.Имя;
	ДанныеПриоритета               = КонвертацияОбъектноСервер.ПриоритетКонвертацииПоТипуОбъектаФормата(КомпонентыОбмена, ТипОбъектаXDTO);
	Результат.Приоритет            = ДанныеПриоритета.Приоритет;
	
	Попытка
		
		ПрочитатьДанныеОбъектаXDTO(Результат, ОбъектXDTO, ПотокЧтения, ТипОбъектаXDTO, ДанныеПриоритета.ПутьКДате);
		
	Исключение
		
		ОтразитьОшибкуПриРазбореЭлементаПакетаОбмена(Результат, НСтр("ru = 'Не удалось получить Объект XDTO из текста'"), ТекстФрагмента);
		
		Возврат Результат;
		
	КонецПопытки;
	
	Результат.СодержимоеЗаписи = ТекстXMLИзОбъектаXDTO(ОбъектXDTO);
	
	Если ПустаяСтрока(Результат.ПолученныйОбъект) Тогда
		Результат.ПолученныйОбъект = ХэшXMLСообщенияОбмена(Результат.СодержимоеЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РезультатЧтенияЭлементаПакетаСообщенияОбмена(КомпонентыОбмена, ПотокЧтения, ТекстФрагмента = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",     Истина);
	Результат.Вставить("ТекстОшибки", "");
	
	НачатьТранзакцию();
	Попытка
		
		РезультатРазбора = РезультатРазбораЭлементаПриЧтенииПакетаОбмена(КомпонентыОбмена, ПотокЧтения, ТекстФрагмента);
		
		Если РезультатРазбора.СтатусОбработки = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации
			И Не КомпонентыОбмена.ЧтениеЭлементаПутемКопированияФрагментаПотока Тогда 
			
			Результат.Успешно     = Ложь;
			Результат.ТекстОшибки = РезультатРазбора.ДанныеОшибки.ПолноеПредставление;
			
			ОтменитьТранзакцию();
			Возврат Результат;
			
		КонецЕсли;
		
		ДанныеЗаписи = РезультатРазбора.ДанныеЗаписи;
		
		ЗаблокироватьЗаписьРегистра(ДанныеЗаписи.ПолученныйОбъект, ДанныеЗаписи.УзелПланаОбмена, ДанныеЗаписи.ОбъектФормата);
		ЗаписатьДанные(РезультатРазбора.ДанныеЗаписи);
		
		Если РезультатРазбора.СтатусОбработки = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации Тогда
			
			ДанныеЗаписиОбъектыКЗагрузке = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеОбработкиОбъекта();
			ДанныеЗаписиОбъектыКЗагрузке.ПолученныйОбъект               = ДанныеЗаписи.ПолученныйОбъект;
			ДанныеЗаписиОбъектыКЗагрузке.УзелПланаОбмена                = ДанныеЗаписи.УзелПланаОбмена;
			ДанныеЗаписиОбъектыКЗагрузке.ОбъектФормата                  = ДанныеЗаписи.ОбъектФормата;
			ДанныеЗаписиОбъектыКЗагрузке.ПричинаДобавления              = РезультатРазбора.СтатусОбработки;
			ДанныеЗаписиОбъектыКЗагрузке.ПолноеПредставлениеОшибки      = РезультатРазбора.ДанныеОшибки.ПолноеПредставление;
			ДанныеЗаписиОбъектыКЗагрузке.КраткоеПредставлениеОшибки     = РезультатРазбора.ДанныеОшибки.КраткоеПредставление;
			ДанныеЗаписиОбъектыКЗагрузке.ДатаОбрабатываемойВерсии       = ДанныеЗаписи.ДатаДобавления;
			
			РегистрыСведений.ОбъектыКЗагрузке.ОтразитьОбработкуОбъекта(ДанныеЗаписиОбъектыКЗагрузке);
			
		Иначе
			
			КомпонентыОбмена.КоличествоОбъектовКЗагрузке = КомпонентыОбмена.КоличествоОбъектовКЗагрузке + 1;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Удаляет данные из регистров "Прочитанные данные сообщений обмена" и "Объекты к загрузке"
// по ключу обрабатывающего задания
//
// Параметры:
//  КлючОбрабатывающегоЗадания - Строка - ключ задания, обрабатывающего данные
//
Процедура УдалитьДанныеПоКлючуОбрабатывающегоЗадания(КлючОбрабатывающегоЗадания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект   КАК ПолученныйОбъект,
	|	ОбъектыКЗагрузке.ПравилоКонвертации                 КАК ПравилоКонвертации,
	|	ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена    КАК УзелПланаОбмена,
	|	ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата      КАК ОбъектФормата
	|ИЗ
	|	РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект   = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ОбъектФормата   = ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата
	|ГДЕ
	|	ПрочитанныеДанныеСообщенийОбмена.КлючОбрабатывающегоЗадания = &КлючОбрабатывающегоЗадания";
	
	Запрос.УстановитьПараметр("КлючОбрабатывающегоЗадания", КлючОбрабатывающегоЗадания);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗаписи = НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.УзелПланаОбмена    = Выборка.УзелПланаОбмена;
		ДанныеЗаписи.ПолученныйОбъект   = Выборка.ПолученныйОбъект;
		ДанныеЗаписи.ОбъектФормата      = Выборка.ОбъектФормата;
		
		УдалитьЗаписьРегистра(ДанныеЗаписи);
		
		Если Выборка.ПравилоКонвертации <> Null Тогда
			
			ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеЗаписиРегистра();
			
			ДанныеЗаписи.УзелПланаОбмена    = Выборка.УзелПланаОбмена;
			ДанныеЗаписи.ПолученныйОбъект   = Выборка.ПолученныйОбъект;
			ДанныеЗаписи.ПравилоКонвертации = Выборка.ПравилоКонвертации;
			ДанныеЗаписи.ОбъектФормата      = Выборка.ОбъектФормата;
			
			РегистрыСведений.ОбъектыКЗагрузке.УдалитьЗаписьРегистра(ДанныеЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЧтениеПакетаПутемКопированияФрагментов

// Копируется текущий элемент из потока чтения XML.
//
// Параметры:
//  ПотокЧтения - ЧтениеXML - поток чтения выгрузки.
//
// Возвращаемое значение:
//  Строка - текст фрагмента XML.
//
Функция РезультатКопированияФрагментаПотока(ПотокЧтения)
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно",        Истина);
	Результат.Вставить("ТекстОшибки",    "");
	Результат.Вставить("ТекстФрагмента", "");
	
	ЗаписьФрагмента = Новый ЗаписьXML;
	ЗаписьФрагмента.УстановитьСтроку();
	
	ИмяУзлаФрагмента = ПотокЧтения.Имя;
	
	КорневойУзел = Истина;
	Попытка
		
		Пока НЕ (ПотокЧтения.ТипУзла = ТипУзлаXML.КонецЭлемента
				И ПотокЧтения.Имя = ИмяУзлаФрагмента) Цикл
			
			ЗаписьФрагмента.ЗаписатьТекущий(ПотокЧтения);
			
			Если ПотокЧтения.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				Если КорневойУзел Тогда
					URIПространствИмен = ПотокЧтения.КонтекстПространствИмен.URIПространствИмен();
					Для Каждого URI Из URIПространствИмен Цикл
						ЗаписьФрагмента.ЗаписатьСоответствиеПространстваИмен(ПотокЧтения.КонтекстПространствИмен.НайтиПрефикс(URI), URI);
					КонецЦикла;
					КорневойУзел = Ложь;
				КонецЕсли;
				
				ПрефиксыURIПространствИменЭлемента = ПотокЧтения.КонтекстПространствИмен.СоответствияПространствИмен();
				Для Каждого КлючИЗначение Из ПрефиксыURIПространствИменЭлемента Цикл
					Префикс = КлючИЗначение.Ключ;
					URIЭлемента = КлючИЗначение.Значение;
					ЗаписьФрагмента.ЗаписатьСоответствиеПространстваИмен(Префикс, URIЭлемента);
				КонецЦикла;
				
			КонецЕсли;
			
			ПотокЧтения.Прочитать();
		КонецЦикла;
		
		ЗаписьФрагмента.ЗаписатьТекущий(ПотокЧтения);
		
		ПотокЧтения.Прочитать();
		
	Исключение
		Результат.Успешно = Ложь;
		Результат.Вставить("ТекстОшибки", НСтр("ru = 'Ошибка чтения фрагмента сообщения'"));
	КонецПопытки;
	
	Результат.ТекстФрагмента = ЗаписьФрагмента.Закрыть();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция НаборИЗаписьРегистра(ДанныеЗаписи)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолученныйОбъект.Установить(ДанныеЗаписи.ПолученныйОбъект);
	НаборЗаписей.Отбор.УзелПланаОбмена.Установить(ДанныеЗаписи.УзелПланаОбмена);
	НаборЗаписей.Отбор.ОбъектФормата.Установить(ДанныеЗаписи.ОбъектФормата);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		
	Иначе
		
		ЗаписьНабора = НаборЗаписей[0];
		
	КонецЕсли; 
	
	ДанныеРегистра = Новый Структура;
	ДанныеРегистра.Вставить("НаборЗаписей", НаборЗаписей);
	ДанныеРегистра.Вставить("ЗаписьНабора", ЗаписьНабора);
	
	Возврат ДанныеРегистра;
	
КонецФункции

// Получает узел плана обмена полученного сообщения
// 
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  ПланОбменаСсылкаИмяПланаОбмена - 
//
Функция УзелПланаОбменаСообщения(КомпонентыОбмена)
	
	Если ЗначениеЗаполнено(КомпонентыОбмена.УзелКорреспондента) Тогда
		Возврат КомпонентыОбмена.УзелКорреспондента;
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КомпонентыОбмена, "ЭтотУзел") Тогда
			Возврат КомпонентыОбмена.ЭтотУзел;
		Иначе
			КомпонентыОбмена.Вставить("ЭтотУзел", ПланОбменаЭтотУзелУниверсальныйФормат());
			Возврат КомпонентыОбмена.ЭтотУзел;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
